danarcana/rcrf_system/sensor_stm8s/main.c
/* MAIN.C file
 * 
 * Copyright (c) 2002-2005 STMicroelectronics
 */

//#include "stm8s_spi.h"
//#include "stm8s_clk.h"
#include "iostm8s003.h"

#include "stm8s.h"
#include "stm8s_gpio.h"
#include "stm8s_i2c.h"
#include "stm8s_clk.h"

typedef enum
{
  RC11XX_PACKET_MODE    = 0,
  RC11XX_TRANSPARENT_MODE
} rc11xx_protocol_mode_t;

typedef enum
{
  RC11XX_GATEWAY = 1,
  RC11XX_ROUTER,
  RC11XX_END_DEVICE
} rc11xx_device_type_t;

typedef enum
{
  RC11XX_INDICATORS_OFF = 0,
  RC11XX_INDICATORS_ON  = 255
} rc11xx_indicators_t;

typedef enum
{
  RC11XX_IMA_ON_CONNECT_OFF = 0,
  RC11XX_IMA_ON_CONNECT_ON  = 1
} rc11xx_ima_on_connect_t;


typedef union {
		uint16_t u16; // element specifier for accessing whole u16
		int16_t i16; // element specifier for accessing whole i16
		struct 
		{
#ifdef LITTLE_ENDIAN // Byte-order is little endian
		uint8_t u8L; // element specifier for accessing low u8
		uint8_t u8H; // element specifier for accessing high u8
#else // Byte-order is big endian
		uint8_t u8H; // element specifier for accessing low u8
		uint8_t u8L; // element specifier for accessing high u8
#endif
		} s16; // element spec. for acc. struct with low or high u8
}int16Union;

#define RC11XX_CMD_SET_SLEEP_MODE					'Z'
#define RC11XX_CMD_ALTERNATE_SLEEP_MODE		'z'
#define RC11XX_CMD_GET_VOLTAGE						'V'
#define RC11XX_CMD_GET_RSSI								'S'
#define RC11XX_CMD_SET_END_DEVICE_MODE		'N'
#define RC11XX_CMD_SET_ROUTER_MODE				'R'
#define RC11XX_CMD_GATEWAY_MODE						'G'
#define RC11XX_CMD_READ_CONFIG_MEMORY			'Y'
#define RC11XX_CMD_WRITE_CONFIG_MEMORY		'M'
#define RC11XX_CMD_TERMINATE_CONFIG_MEMORY		255
#define RC11XX_CMD_WRITE_CALIB_MEMORY		  "HW"
#define RC11XX_CMD_EXIT_CONFIG_MODE				'X'
#define RC11XX_CMD_LIST_CALIB_MEMORY			'r'
#define RC11XX_CMD_LIST_CONFIG_MEMORY			'0'
#define RC11XX_PROMPT											'>'

#define RC11XX_ADDRESS_CFG_MEM_RF_POWER			1
#define RC11XX_ADDRESS_CFG_MEM_DATA_RATE		2
#define RC11XX_ADDRESS_CFG_MEM_PROTOCOL_MODE 	3
#define RC11XX_ADDRESS_CFG_MEM_DEVICE_TYPE	14

#define RC11XX_ADDRESS_CFG_MEM_UID0				45
#define RC11XX_ADDRESS_CFG_MEM_UID1				46
#define RC11XX_ADDRESS_CFG_MEM_UID2				47
#define RC11XX_ADDRESS_CFG_MEM_UID3				48

#define RC11XX_ADDRESS_CFG_MEM_SID0				49
#define RC11XX_ADDRESS_CFG_MEM_SID1				50
#define RC11XX_ADDRESS_CFG_MEM_SID2				51
#define RC11XX_ADDRESS_CFG_MEM_SID3				52

#define RC11XX_ADDRESS_CFG_MEM_ED_WAIT_CMD		86
#define RC11XX_ADDRESS_CFG_MEM_WAKE_SOURCE		87
#define RC11XX_ADDRESS_CFG_MEM_INDICATORS_ON	89
#define RC11XX_ADDRESS_CFG_MEM_IMA_ON_CONNECT	94

#define RC11XX_ADDRESS_CALIB_MEMORY_NID0	23
#define RC11XX_ADDRESS_CALIB_MEMORY_NID1	24
#define RC11XX_ADDRESS_CALIB_MEMORY_NID2	25
#define RC11XX_ADDRESS_CALIB_MEMORY_NID3	26

#define RC11XX_ADDRESS_CALIB_MEMORY_FDID0	27
#define RC11XX_ADDRESS_CALIB_MEMORY_FDID1	28
#define RC11XX_ADDRESS_CALIB_MEMORY_FDID2	29
#define RC11XX_ADDRESS_CALIB_MEMORY_FDID3	30

//#define RC11XX_CFG_DATA_RATE							2
#define RC11XX_CFG_DATA_RATE							3
#define RC11XX_CFG_DEVICE_TYPE						RC11XX_END_DEVICE
#define RC11XX_CFG_PROTOCOL_MODE					RC11XX_PACKET_MODE
//Wake up source on usart
#define RC11XX_CFG_WAKE_UP_SOURCE					4

#pragma pack(1)
typedef struct
{
	uint8_t   rf_channel;
  uint8_t   rf_power;
  uint8_t   data_rate;
  uint8_t 	protocol_mode;
  uint8_t   rssi_acceptance_lvl;
  uint8_t   hiam_time;
  uint8_t   ima_time;
  uint8_t   device_type;
  uint8_t 	uid[4];
  uint8_t   sid[4];
  uint8_t   ima_basetime;
  uint8_t   end_device_wait_cmd;
  uint8_t   end_device_wakeup_enable;
  uint8_t   indicators_on;
  uint8_t   receive_neighbour_msg;
  uint8_t 	ima_on_connect;
} rc11xx_config_mem_t;

rc11xx_config_mem_t  rc_config_mem = {0};
uint8_t SerialNumber_SHT2x[8];  //64bit serial number
int16Union sts21_temperature = {0};
float measured_temperature = 0.0f;

bool rc_enter_config(void);
void rc_exit_config(void);
void rc_configure_ed(void);
void rc_hw_reset(void);

void I2C_ClearBusyFlagErrata_2_14_7(void);
uint8_t SHT2x_SoftReset(void);


uint8_t I2C_CheckBusy(void);
uint8_t I2C_StartCondition(void);
uint8_t I2C_SendAddress(uint8_t address);
uint8_t I2C_WriteByte(uint8_t data);
uint8_t I2C_ReadByte(void);
float SHT2x_CalcTemperatureC(uint16_t u16sT);
uint16_t SHT2x_MeasureTempHoldMaster(void);

void USART_TX(unsigned char val) {
  UART1_DR = val;
  while (!(UART1_SR & (1 << 6)));
}

unsigned char USART_RX(void) {
  while (!(UART1_SR & (1 << 5)));
  return UART1_DR;
}


#define RC11XX_CFG_PIN GPIOD, GPIO_PIN_4
#define RC11XX_RST_PIN GPIOD, GPIO_PIN_3

#ifdef USE_FULL_ASSERT

/**
  * @brief  Reports the name of the source file and the source line number
  *   where the assert_param error has occurred.
  * @param file: pointer to the source file name
  * @param line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{ 
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  /* Infinite loop */
  while (1)
  {
  }
}
#endif


#define F_CPU 16000000UL
#ifndef F_CPU
#warning "F_CPU not defined, using 2MHz by default"
#define F_CPU 2000000UL
#endif


#if defined(__CSMC__)
static @inline void _delay_cycl( unsigned short __ticks )
{
/* COSMIC */  
	#define T_COUNT(x) (( x * (FCLK / 1000000UL) )-3)/3)
	// ldw X, __ticks ; insert automaticaly
	_asm("nop\n $N:\n decw X\n jrne $L\n nop\n ", __ticks);
}
#endif


void delay_ms(uint32_t ms) 
{
    uint32_t i;
//   for (i = 0; i < ((F_CPU / 18 / 1000UL) * ms); i++) {
//        _asm("nop");
//    }
	for (i = 0; i < ms; i++) 
	{
			_delay_cycl((unsigned short) (T_COUNT(1000));
	}
}



//void delay(int ms) //Function Definition 
//{
//	int i =0 ;
//	int j=0;
//	for (i=0; i<=ms; i++)
//	{
//		for (j=0; j<120; j++) // Nop = Fosc/4
//			_asm("nop"); //Perform no operation //assembly code 
//	}
//}

void rc_wait_for_prompt(void)
{
	uint8_t inChar = 0;
	uint8_t i =0;
	//wait for prompt - 10 retries
	for (i=0;i<10;i++)
	{
		while ((UART1_SR & (1 << 5))==0){};
		inChar = USART_RX();
		if(inChar == '>')
		{
			break;
		}
	}
}

bool rc_enter_config(void)
{
	uint8_t ret_val = FALSE;
	uint8_t in_char=0;
	uint8_t i=0;
	rc_hw_reset();
	GPIO_WriteLow(RC11XX_CFG_PIN);
	while (!(UART1_SR & (1 << 5)));
	
	
	for (i=0;i<3;i++)
	{
		in_char = USART_RX();
		if ('>'==in_char)
		{
			ret_val = TRUE;
			break;
		}
	}
	GPIO_WriteHigh(RC11XX_CFG_PIN);
	return ret_val;
}


