danarcana/rcrf_system/sensor_stm8s/main.c
void rc_exit_config(void)
{
	USART_TX(RC11XX_CMD_EXIT_CONFIG_MODE);
}


void rc_hw_reset(void)
{
	GPIO_WriteLow(RC11XX_RST_PIN);
	delay_ms(100);
	GPIO_WriteHigh(RC11XX_RST_PIN);
}

void rc_write_config_value(uint8_t config_address, uint8_t config_value)
{
	uint8_t inChar = 0;
	
	USART_TX(RC11XX_CMD_WRITE_CONFIG_MEMORY);
	//rc_wait_for_prompt();
	while (!(UART1_SR & (1 << 5)));
	USART_TX(config_address);
	USART_TX(config_value);
	USART_TX(RC11XX_CMD_TERMINATE_CONFIG_MEMORY);
	//rc_wait_for_prompt();
	while (inChar!='>')
	{
			while (!(UART1_SR & (1 << 5))){};
			inChar = USART_RX();
	}
	delay_ms(20);
}

void rc_write_config_array(uint8_t *config_array, uint8_t array_len)
{
	uint8_t inChar = 0;
	uint8_t i = 0;
	USART_TX(RC11XX_CMD_WRITE_CONFIG_MEMORY);
	//rc_wait_for_prompt();
	//while (!(UART1_SR & (1 << 5)));
	while (inChar!='>')
	{
			while (!(UART1_SR & (1 << 5))){};
			inChar = USART_RX();
	}
	for (i=0;i<array_len;i++)
	{
		USART_TX(*config_array);
		config_array++;
	}
	USART_TX(RC11XX_CMD_TERMINATE_CONFIG_MEMORY);
	while (inChar!='>')
	{
			while (!(UART1_SR & (1 << 5))){};
			inChar = USART_RX();
	}
	delay_ms(20);
}

uint8_t rc_read_config_address(uint8_t cfg_address)
{
	uint8_t in_char = 0;
	uint8_t ret_val = 0;
	USART_TX(RC11XX_CMD_READ_CONFIG_MEMORY);
	USART_TX(cfg_address);
	ret_val = USART_RX();
	in_char = USART_RX();		//prompt char
	return ret_val;
}

void rc_configure_ed()
{
	uint8_t config_value = 0;
	uint8_t config_array[20] = {0};
	uint8_t config_array_idx = 0;

	rc_enter_config();
	
	rc_config_mem.data_rate = rc_read_config_address(RC11XX_ADDRESS_CFG_MEM_DATA_RATE);
	rc_config_mem.device_type = rc_read_config_address(RC11XX_ADDRESS_CFG_MEM_DEVICE_TYPE);
	rc_config_mem.protocol_mode = rc_read_config_address(RC11XX_ADDRESS_CFG_MEM_PROTOCOL_MODE);
	rc_config_mem.indicators_on = rc_read_config_address(RC11XX_ADDRESS_CFG_MEM_INDICATORS_ON);
	rc_config_mem.ima_on_connect = rc_read_config_address(RC11XX_ADDRESS_CFG_MEM_IMA_ON_CONNECT);
	rc_config_mem.end_device_wait_cmd = rc_read_config_address(RC11XX_ADDRESS_CFG_MEM_ED_WAIT_CMD);
	rc_config_mem.end_device_wakeup_enable = rc_read_config_address(RC11XX_ADDRESS_CFG_MEM_WAKE_SOURCE);

	if (rc_config_mem.data_rate!=RC11XX_CFG_DATA_RATE)
	{
		//rc_write_config_value(RC11XX_ADDRESS_CFG_MEM_DATA_RATE,RC11XX_CFG_DATA_RATE);
		config_array[config_array_idx] = RC11XX_ADDRESS_CFG_MEM_DATA_RATE; config_array_idx++;
		config_array[config_array_idx] = RC11XX_CFG_DATA_RATE; config_array_idx++;
	}

	if (rc_config_mem.device_type!=RC11XX_CFG_DEVICE_TYPE)
	{
		//rc_write_config_value(RC11XX_ADDRESS_CFG_MEM_DEVICE_TYPE,RC11XX_CFG_DEVICE_TYPE);
		config_array[config_array_idx] = RC11XX_ADDRESS_CFG_MEM_DEVICE_TYPE; config_array_idx++;
		config_array[config_array_idx] = RC11XX_CFG_DEVICE_TYPE; config_array_idx++;
	}
	
	if (rc_config_mem.protocol_mode!=RC11XX_CFG_PROTOCOL_MODE)
	{
//		rc_write_config_value(RC11XX_ADDRESS_CFG_MEM_PROTOCOL_MODE,RC11XX_CFG_PROTOCOL_MODE);
		config_array[config_array_idx] = RC11XX_ADDRESS_CFG_MEM_PROTOCOL_MODE; config_array_idx++;
		config_array[config_array_idx] = RC11XX_CFG_PROTOCOL_MODE; config_array_idx++;
	}

	if (rc_config_mem.indicators_on!=RC11XX_INDICATORS_ON)
	{
//		rc_write_config_value(RC11XX_ADDRESS_CFG_MEM_INDICATORS_ON,RC11XX_INDICATORS_OFF);
		config_array[config_array_idx] = RC11XX_ADDRESS_CFG_MEM_INDICATORS_ON; config_array_idx++;
		config_array[config_array_idx] = RC11XX_INDICATORS_ON; config_array_idx++;
	}
	
	if (rc_config_mem.ima_on_connect!=RC11XX_IMA_ON_CONNECT_OFF)
	{
//		rc_write_config_value(RC11XX_ADDRESS_CFG_MEM_IMA_ON_CONNECT,RC11XX_IMA_ON_CONNECT_OFF);
		config_array[config_array_idx] = RC11XX_ADDRESS_CFG_MEM_IMA_ON_CONNECT; config_array_idx++;
		config_array[config_array_idx] = RC11XX_IMA_ON_CONNECT_OFF; config_array_idx++;
	}

	//10 x 0.1 sec
	if (rc_config_mem.end_device_wait_cmd!=10)
	{
//		rc_write_config_value(RC11XX_ADDRESS_CFG_MEM_ED_WAIT_CMD,10);
		config_array[config_array_idx] = RC11XX_ADDRESS_CFG_MEM_ED_WAIT_CMD; config_array_idx++;
		config_array[config_array_idx] = 10; config_array_idx++;
	}
	
	if (rc_config_mem.end_device_wakeup_enable!=RC11XX_CFG_WAKE_UP_SOURCE)
	{
		//rc_write_config_value(RC11XX_ADDRESS_CFG_MEM_WAKE_SOURCE,RC11XX_CFG_WAKE_UP_SOURCE);
		config_array[config_array_idx] = RC11XX_ADDRESS_CFG_MEM_WAKE_SOURCE; config_array_idx++;
		config_array[config_array_idx] = RC11XX_CFG_WAKE_UP_SOURCE; config_array_idx++;
	}
	rc_write_config_array(config_array, config_array_idx);
	delay_ms(70);
	rc_exit_config();
	//rc_hw_reset();
}
uint8_t counter_tx=0;

typedef enum{
  I2C_ADR_W   = 0x94,   // sensor I2C address + write bit
  I2C_ADR_R		= 0x95    // sensor I2C address + read bit
}etSTS21Address;

typedef enum{
TRIG_T_MEASUREMENT_HM = 0xE3, // command trig. temp meas. hold master
TRIG_T_MEASUREMENT_POLL = 0xF3, // command trig. temp meas. no hold master
USER_REG_W = 0xE6, // command writing user register
USER_REG_R = 0xE7, // command reading user register
SOFT_RESET 	= 0xFE // command soft reset
}etSHT2xCommand;


/* Maximum Timeout values for flags and events waiting loops. These timeouts are
   not based on accurate values, they just guarantee that the application will
   not remain stuck if the I2C communication is corrupted.
   You may modify these timeout values depending on CPU frequency and application
   conditions (interrupts routines ...). */
#define sEE_FLAG_TIMEOUT         ((uint32_t)0x5000)
#define sEE_LONG_TIMEOUT         ((uint32_t)(10 * sEE_FLAG_TIMEOUT))
__IO uint32_t  sEETimeout = sEE_LONG_TIMEOUT;


/**
  * @brief  Example of timeout situation management.
  * @param  None.
  * @retval None.
  */
uint8_t sEE_TIMEOUT_UserCallback(void)
{
  /* User application may try to recover the communication by resetting I2C
    peripheral (calling the function I2C_SoftwareResetCmd()) then re-start
    the transmission/reception from a previously stored recover point.
    For simplicity reasons, this example only shows a basic way for errors 
    managements which consists of stopping all the process and requiring system
    reset. */
  
  
