danarcana/rcrf_system/sensor_stm8s/main.c
  /* Block communication and all processes */
  while (1)
  {   
  }  
}

/** 
  * @brief  GPIO Bit SET and Bit RESET enumeration 
  */
typedef enum
{
  GPIO_PIN_RESET = 0U,
  GPIO_PIN_SET
}GPIO_PinState;



/* USER CODE BEGIN 1 */
/**
1. Disable the I2C peripheral by clearing the PE bit in I2Cx_CR1 register.
2. Configure the SCL and SDA I/Os as General Purpose Output Open-Drain, High level
(Write 1 to GPIOx_ODR).
3. Check SCL and SDA High level in GPIOx_IDR.
4. Configure the SDA I/O as General Purpose Output Open-Drain, Low level (Write 0 to
GPIOx_ODR).
5. Check SDA Low level in GPIOx_IDR.
6. Configure the SCL I/O as General Purpose Output Open-Drain, Low level (Write 0 to
GPIOx_ODR).
7. Check SCL Low level in GPIOx_IDR.
8. Configure the SCL I/O as General Purpose Output Open-Drain, High level (Write 1 to
GPIOx_ODR).
9. Check SCL High level in GPIOx_IDR.
10. Configure the SDA I/O as General Purpose Output Open-Drain , High level (Write 1 to
GPIOx_ODR).
11. Check SDA High level in GPIOx_IDR.
12. Configure the SCL and SDA I/Os as Alternate function Open-Drain.
13. Set SWRST bit in I2Cx_CR1 register.
14. Clear SWRST bit in I2Cx_CR1 register.
15. Enable the I2C peripheral by setting the PE bit in I2Cx_CR1 register.
**/
void I2C_ClearBusyFlagErrata_2_14_7(void) {

		uint8_t SDA_PIN = GPIO_PIN_4;
    uint8_t SCL_PIN = GPIO_PIN_5;
		

		static uint8_t resetTried = 0;
    if (resetTried == 1) {
        return ;
    }
    //uint32_t SDA_PIN = NUCLEO_I2C_EXPBD_SDA_PIN;
    //uint32_t SCL_PIN = NUCLEO_I2C_EXPBD_SCL_PIN;

 //   GPIO_InitTypeDef GPIO_InitStruct;

    // 1
//    __HAL_I2C_DISABLE(hi2c);
		I2C_Cmd( DISABLE);

    // 2
//    GPIO_InitStruct.Pin = SDA_PIN|SCL_PIN;
//    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_OD;
//    GPIO_InitStruct.Pull = GPIO_NOPULL;
//    GPIO_InitStruct.Speed = GPIO_SPEED_FAST;
//    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

//    HAL_GPIO_WRITE_ODR(GPIOB, SDA_PIN);
//    HAL_GPIO_WRITE_ODR(GPIOB, SCL_PIN);

		GPIO_Init(GPIOB, SDA_PIN, GPIO_MODE_OUT_OD_HIZ_FAST);

		GPIO_Init(GPIOB, SCL_PIN, GPIO_MODE_OUT_OD_HIZ_FAST);
		
		GPIO_Write(GPIOB, SDA_PIN|SCL_PIN);
//		GPIO_Write(GPIOB, GPIO_PIN_5);


    // 3
 //   GPIO_PinState pinState;
//    if (HAL_GPIO_ReadPin(GPIOB, SDA_PIN) == GPIO_PIN_RESET) {
//        for(;;){}
//    }
//    if (HAL_GPIO_ReadPin(GPIOB, SCL_PIN) == GPIO_PIN_RESET) {
//        for(;;){}
//    }
		if (GPIO_ReadInputPin(GPIOB, SDA_PIN) == GPIO_PIN_RESET) {
        for(;;){}
    }
    if (GPIO_ReadInputPin(GPIOB, SCL_PIN) == GPIO_PIN_RESET) {
        //for(;;){}
    }
		
    // 4
//    GPIO_InitStruct.Pin = SDA_PIN;
//    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
		
		GPIO_Init(GPIOB, SDA_PIN, GPIO_MODE_OUT_OD_HIZ_FAST);

    //HAL_GPIO_TogglePin(GPIOB, SDA_PIN);
		GPIO_WriteLow(GPIOB, SDA_PIN);

    // 5
    if (GPIO_ReadInputPin(GPIOB, SDA_PIN) == GPIO_PIN_SET) {
        for(;;){}
    }

    // 6
    //GPIO_InitStruct.Pin = SCL_PIN;
    //HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

    //HAL_GPIO_TogglePin(GPIOB, SCL_PIN);
		GPIO_Init(GPIOB, SCL_PIN, GPIO_MODE_OUT_OD_HIZ_FAST);
		
		GPIO_WriteLow(GPIOB, SCL_PIN);

    // 7
    if (GPIO_ReadInputPin(GPIOB, SCL_PIN) == GPIO_PIN_SET) {
        for(;;){}
    }

    // 8
   // GPIO_InitStruct.Pin = SDA_PIN;
   // HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

    //HAL_GPIO_WRITE_ODR(GPIOB, SDA_PIN);
		GPIO_Init(GPIOB, SDA_PIN, GPIO_MODE_OUT_OD_HIZ_FAST);
		GPIO_Write(GPIOB, SDA_PIN);

    // 9
    if (GPIO_ReadInputPin(GPIOB, SDA_PIN) == GPIO_PIN_RESET) {
        for(;;){}
    }

    // 10
    //GPIO_InitStruct.Pin = SCL_PIN;
    //HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

    //HAL_GPIO_WRITE_ODR(GPIOB, SCL_PIN);
		
		GPIO_Init(GPIOB, SCL_PIN, GPIO_MODE_OUT_OD_HIZ_FAST);
		GPIO_Write(GPIOB, SDA_PIN|SCL_PIN);

    // 11
    if (GPIO_ReadInputPin(GPIOB, SCL_PIN) == GPIO_PIN_RESET) {
        //for(;;){}
    }

    // 12
//    GPIO_InitStruct.Pin = SDA_PIN|SCL_PIN;
//    GPIO_InitStruct.Mode = GPIO_MODE_AF_OD;
//    GPIO_InitStruct.Alternate = NUCLEO_I2C_EXPBD_SCL_SDA_AF;
//    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

   // 13
   //hi2c->Instance->CR1 |= I2C_CR1_SWRST;
	 I2C->CR2 |= I2C_CR2_SWRST;

   // 14
   //hi2c->Instance->CR1 ^= I2C_CR1_SWRST;
	 I2C->CR2 ^= I2C_CR2_SWRST;

   // 15
   //__HAL_I2C_ENABLE(hi2c);

	I2C_Cmd(ENABLE);
   resetTried = 1;
}

//void HAL_GPIO_WRITE_ODR(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin)
//{
  /* Check the parameters */
  //assert_param(IS_GPIO_PIN(GPIO_Pin));

  //GPIOx->ODR |= GPIO_Pin;
//}

uint8_t I2C_CheckBusy(void)
{
	/* While the bus is busy */
  sEETimeout = sEE_LONG_TIMEOUT;
  while(I2C_GetFlagStatus( I2C_FLAG_BUSBUSY))
  {
    if((sEETimeout--) == 0) return sEE_TIMEOUT_UserCallback();
  }
}

uint8_t I2C_StartCondition(void)
{
	 /* Send START condition */
  I2C_GenerateSTART(ENABLE);
	
  /* Test on EV5 and clear it (cleared by reading SR1 then writing to DR) */
  sEETimeout = sEE_FLAG_TIMEOUT;
  while(!I2C_CheckEvent( I2C_EVENT_MASTER_MODE_SELECT))
  {
    if((sEETimeout--) == 0) return sEE_TIMEOUT_UserCallback();
  }
}

uint8_t I2C_SendAddress(uint8_t address)
{
  I2C_SendData(address);    //I2C address

  /* Test on EV6 and clear it */
  sEETimeout = sEE_FLAG_TIMEOUT;
	if (address&0x01)
	{
		while(!I2C_CheckEvent( I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED))
		{
			if((sEETimeout--) == 0) return sEE_TIMEOUT_UserCallback();
		}
	}
	else
	{
		while(!I2C_CheckEvent( I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED))
		{
			if((sEETimeout--) == 0) return sEE_TIMEOUT_UserCallback();
		}
	}
}

uint8_t I2C_WriteByte(uint8_t data)
{
	I2C_SendData(data);         //Command for readout on-chip memory
	
	/* Test on EV8 and clear it */
  sEETimeout = sEE_FLAG_TIMEOUT;
	//Event = I2C_GetLastEvent();
  while(!I2C_CheckEvent( I2C_EVENT_MASTER_BYTE_TRANSMITTED))
  {
		//Event = I2C_GetLastEvent();
			if((sEETimeout--) == 0) return sEE_TIMEOUT_UserCallback();
  }
}

uint8_t I2C_ReadByte(void)
{
	while ((I2C_GetFlagStatus(I2C_FLAG_RXNOTEMPTY) == RESET)); /* Poll on RxNE */
	return I2C_ReceiveData();
}

