danarcana/rcrf_system/sensor_stm8s/main.c
uint8_t I2C_StopCondition(void)
{
	I2C_GenerateSTOP(ENABLE);
}
//==============================================================================
uint8_t SHT2x_GetSerialNumber(uint8_t u8SerialNumber[])
//==============================================================================
{
  uint8_t  error=0;                          //error variable
	uint16_t Event = 0;
	
	I2C_CheckBusy();
	I2C_StartCondition();
	I2C_SendAddress(I2C_ADR_W);
	I2C_WriteByte(0xFA);
	I2C_WriteByte(0x0F);

	I2C_StartCondition();
	I2C_SendAddress(I2C_ADR_R);
	
	u8SerialNumber[5] = I2C_ReadByte(); //Read SNB_3
  I2C_ReadByte();                     //Read CRC SNB_3 (CRC is not analyzed)
  u8SerialNumber[4] = I2C_ReadByte(); //Read SNB_2
  I2C_ReadByte();                     //Read CRC SNB_2 (CRC is not analyzed)
  u8SerialNumber[3] = I2C_ReadByte(); //Read SNB_1
  I2C_ReadByte();                     //Read CRC SNB_1 (CRC is not analyzed)
  u8SerialNumber[2] = I2C_ReadByte(); //Read SNB_0
  I2C_AcknowledgeConfig(I2C_ACK_NONE);
	I2C_ReadByte();                  //Read CRC SNB_0 (CRC is not analyzed)
	
	I2C_GenerateSTOP(ENABLE);

  //Read from memory location 2
  I2C_StartCondition();
	I2C_SendAddress(I2C_ADR_W);
	I2C_WriteByte(0xFC);
	I2C_WriteByte(0xC9);
	I2C_StartCondition();
	I2C_SendAddress(I2C_ADR_R);
	I2C_AcknowledgeConfig(I2C_ACK_CURR);
  u8SerialNumber[1] = I2C_ReadByte(); //Read SNC_1
  u8SerialNumber[0] = I2C_ReadByte(); //Read SNC_0
  I2C_ReadByte();                     //Read CRC SNC0/1 (CRC is not analyzed)
  u8SerialNumber[7] = I2C_ReadByte(); //Read SNA_1
  u8SerialNumber[6] = I2C_ReadByte(); //Read SNA_0
	I2C_AcknowledgeConfig(I2C_ACK_NONE);
  I2C_ReadByte();                  //Read CRC SNA0/1 (CRC is not analyzed)
  I2C_GenerateSTOP(ENABLE);
	
  return error;
}

float SHT2x_CalcTemperatureC(uint16_t u16sT)
{
	float temperatureC; // variable for result
	u16sT &= ~0x0003; // clear bits [1..0] (status bits)
	//-- calculate temperature [°C] --
	temperatureC= -46.85 + 175.72/65536 *(float)u16sT; //T= -46.85 + 175.72 * ST/2^16
	return temperatureC;
}



uint16_t SHT2x_MeasureTempHoldMaster(void)
{
		uint8_t checksum; //checksum
		uint8_t data[2]; //data array for checksum verification
		uint8_t error=0; //error variable
		uint16_t i; //counting variable
		//-- write I2C sensor address and command --
		I2C_StartCondition();
		//error |= I2C_WriteByte(I2C_ADR_W); // I2C Adr
		error |= I2C_SendAddress(I2C_ADR_W); // I2C Adr
		error |= I2C_WriteByte(TRIG_T_MEASUREMENT_HM);
		//-- wait until hold master is released --
		I2C_StartCondition();
		error |= I2C_SendAddress(I2C_ADR_R);
//		SCL=HIGH; // set SCL I/O port as input
		for(i=0; i<100; i++) // wait until master hold is released or
		{
		  delay_ms(10);
//			DelayMicroSeconds(1000); // a timeout (~1s) is reached
//			if (SCL_CONF==1) break;
		}
		//-- check for timeout --
//		if(SCL_CONF==0) error |= TIME_OUT_ERROR;
		//-- read two data bytes and one checksum byte --
		//sts21_temperature.s16.u8H = data[0] = I2C_ReadByte(ACK);
		//sts21_temperature.s16.u8L = data[1] = I2C_ReadByte(ACK);
		
		sts21_temperature.s16.u8H = data[0] = I2C_ReadByte();
		sts21_temperature.s16.u8L = data[1] = I2C_ReadByte();
		
		//checksum=I2C_ReadByte(NO_ACK);
		checksum=I2C_ReadByte();
		//-- verify checksum --
//		error |= SHT2x_CheckCrc(data,2,checksum);
		I2C_StopCondition();
		return error;
}

uint8_t SHT2x_SoftReset(void)
{
	uint8_t error=0; //error variable
	//I2c_StartCondition();
	I2C_GenerateSTART(ENABLE);
	
	  /* Test on EV5 and clear it */
  while (!I2C_CheckEvent(I2C_EVENT_MASTER_MODE_SELECT));
	
	//error |= I2c_WriteByte (I2C_ADR_W); // I2C Adr
	//error |= I2c_WriteByte (SOFT_RESET); // Command
	I2C_SendData (I2C_ADR_W);    //I2C address
	
  /* Send EEPROM address for write */
  //I2C_Send7bitAddress( (uint8_t)0x80, I2C_DIRECTION_TX);

  /* Test on EV6 and clear it */
  sEETimeout = sEE_FLAG_TIMEOUT;
  while(!I2C_CheckEvent( I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED))
  {
    if((sEETimeout--) == 0) return sEE_TIMEOUT_UserCallback();
  }
	
	I2C_SendData (SOFT_RESET);    
	
	/* Test on EV8 and clear it */
  sEETimeout = sEE_FLAG_TIMEOUT;
  while(!I2C_CheckEvent( I2C_EVENT_MASTER_BYTE_TRANSMITTED))
  {
    if((sEETimeout--) == 0) return sEE_TIMEOUT_UserCallback();
  }
	
	//I2c_StopCondition();
	I2C_GenerateSTOP(ENABLE);
	delay_ms(130); // wait till sensor has restarted
	return error;
}
void main(void)
{
	GPIO_DeInit(GPIOD); // prepare Port D for working 
	CLK_CKDIVR = 0x00;  //set clock 16MHZ
  CLK_PCKENR1 = 0xFF;  // Enable peripherals
  UART1_BRR2 = 0x01;
	UART1_BRR1 = 0x34;  // 19200 baud
  UART1_CR3 &= ~((1 << 4) | (1 << 5)); //1 STOP BIT
  UART1_CR2 |= (1 << 2) | (1 << 3); //ENABLE TX AND RX
	
	GPIO_Init (RC11XX_RST_PIN, GPIO_MODE_OUT_PP_HIGH_SLOW);
	GPIO_Init (RC11XX_CFG_PIN, GPIO_MODE_OUT_PP_HIGH_SLOW);
	
	
	GPIO_DeInit(GPIOB);

	GPIO_Init(GPIOB, GPIO_PIN_4, GPIO_MODE_OUT_OD_HIZ_FAST);

	GPIO_Init(GPIOB, GPIO_PIN_5, GPIO_MODE_OUT_OD_HIZ_FAST);
	
	GPIO_DeInit(GPIOC);

	GPIO_Init(GPIOC, GPIO_PIN_3, GPIO_MODE_IN_PU_NO_IT);
	
  
	I2C_DeInit();
	I2C_ClearBusyFlagErrata_2_14_7();
	I2C_Cmd(ENABLE);
	
	//I2C_DeInit();
		 
	
	
	//I2C_Cmd( DISABLE);
	//I2C Init 
 	I2C_Init(88000, 0x200, I2C_DUTYCYCLE_16_9, I2C_ACK_CURR, I2C_ADDMODE_7BIT,(CLK_GetClockFreq() / 1000000));
	//I2C_Init(88000, 128, I2C_DUTYCYCLE_2, I2C_ACK_CURR, I2C_ADDMODE_7BIT,16);
	//I2C_Init_Test();
	//I2C->CR2 |= I2C_CR2_SWRST;
	//CLK->PCKENR1 |= CLK_PCKENR1_I2C1;
	
	CLK_PeripheralClockConfig(CLK_PERIPHERAL_I2C, ENABLE);
	
	
	I2C_Cmd(ENABLE);
	  /* Enable Buffer and Event Interrupt*/
	I2C_ITConfig((I2C_IT_TypeDef)(I2C_IT_ERR), ENABLE);
	//I2C_ITConfig((I2C_IT_TypeDef)(I2C_IT_ERR | I2C_IT_EVT | I2C_IT_BUF), ENABLE);
	//delay_ms(500);
	enableInterrupts();
	
	SHT2x_SoftReset();
	SHT2x_GetSerialNumber(SerialNumber_SHT2x);	
	rc_configure_ed();
	
	while (1) {
		delay_ms(7500);
//		_delay_cycl((unsigned short) (T_COUNT(10000));
		SHT2x_MeasureTempHoldMaster();
		measured_temperature = SHT2x_CalcTemperatureC(sts21_temperature.u16);
		
		USART_TX(counter_tx);
		USART_TX(sts21_temperature.s16.u8H);
		USART_TX(sts21_temperature.s16.u8L);
		USART_TX(counter_tx);
		USART_TX(counter_tx);
		counter_tx++;
  }
}